Repository: NizarMasadeh/i18n-ng
Catalog: src/locale/messages.*.xlf
Languages: ar

# nav.brand
source: NG-AR
ar: أنقولر العربي

# nav.home
source: Home
ar: الرئيسية

# nav.about
source: About
ar: من نحن

# nav.services
source: Services
ar: الخدمات

# nav.contact
source: Contact
ar: اتصل بنا

# footer.copyright
source: © 2024 NG-AR. All rights reserved.
ar: © 2024 تيك كورب. جميع الحقوق محفوظة.

# footer.tagline
source: Building the future, one line of code at a time.
ar: نبني المستقبل، سطر كود واحد في كل مرة.

# home.title
source: Welcome Home
ar: مرحباً بكم في الصفحة الرئيسية

# home.description
source: This is the home page of our multilingual application. Here you can find the latest updates and news.
ar: هذه هي الصفحة الرئيسية لتطبيقنا متعدد اللغات. هنا يمكنكم العثور على آخر التحديثات والأخبار.

# home.features.title
source: Our Features
ar: مميزاتنا

# home.features.responsive
source: Fully responsive design
ar: تصميم متجاوب بالكامل

# home.features.multilingual
source: Support for multiple languages
ar: دعم للغات متعددة

# home.features.ssr
source: Server-side rendering for better SEO
ar: عرض من جانب الخادم لتحسين محركات البحث

# home.features.modern
source: Built with modern Angular framework
ar: مبني بإطار عمل أنجولار الحديث

# home.cta.text
source: Ready to get started? Visit our about page to learn more!
ar: مستعد للبدء؟ زوروا صفحة من نحن لمعرفة المزيد!

# home.cta.button
source: Learn More About Us
ar: تعرف علينا أكثر

# about.title
source: About Our Company
ar: عن شركتنا

# about.intro
source: We are a technology company dedicated to creating innovative solutions for the modern world. Our team consists of passionate developers, designers, and strategists working together to deliver exceptional experiences.
ar: نحن شركة تكنولوجيا مكرسة لإنشاء حلول مبتكرة للعالم الحديث. يتكون فريقنا من مطورين ومصممين واستراتيجيين متحمسين يعملون معاً لتقديم تجارب استثنائية.

# about.mission.title
source: Our Mission
ar: مهمتنا

# about.mission.description
source: To empower businesses and individuals through cutting-edge technology solutions that are accessible, reliable, and designed with the user in mind.
ar: تمكين الشركات والأفراد من خلال حلول تكنولوجية متطورة تكون متاحة وموثوقة ومصممة مع وضع المستخدم في الاعتبار.

# about.values.title
source: Our Values
ar: قيمنا

# about.values.innovation
source: Innovation
ar: الابتكار

# about.values.innovation.desc
source: We constantly push boundaries and explore new possibilities.
ar: نحن نتخطى الحدود باستمرار ونستكشف إمكانيات جديدة.

# about.values.quality
source: Quality
ar: الجودة

# about.values.quality.desc
source: Excellence in every detail is our standard.
ar: التميز في كل التفاصيل هو معيارنا.

# about.values.collaboration
source: Collaboration
ar: التعاون

# about.values.collaboration.desc
source: We believe in the power of working together.
ar: نؤمن بقوة العمل الجماعي.

# about.contact.text
source: Want to know more about our services?
ar: تريد معرفة المزيد عن خدماتنا؟

# about.contact.button
source: Contact Us Today
ar: اتصل بنا اليوم

# services.title
source: Our Services
ar: خدماتنا

# services.intro
source: We offer a comprehensive range of technology services designed to help your business thrive in the digital age. From web development to mobile applications, we have the expertise to bring your vision to life.
ar: نقدم مجموعة شاملة من الخدمات التكنولوجية المصممة لمساعدة عملك على الازدهار في العصر الرقمي. من تطوير المواقع إلى تطبيقات الهاتف المحمول، لدينا الخبرة لتحويل رؤيتك إلى واقع.

# services.web-development.title
source: Web Development
ar: تطوير المواقع

# services.web-development.description
source: Custom websites and web applications built with modern technologies like Angular, React, and Node.js.
ar: مواقع مخصصة وتطبيقات ويب مبنية بتقنيات حديثة مثل أنجولار وريأكت ونود.جي إس.

# services.web-development.feature0
source: Responsive Design
ar: تصميم متجاوب

# services.web-development.feature1
source: SEO Optimization
ar: تحسين محركات البحث

# services.web-development.feature2
source: Performance Optimization
ar: تحسين الأداء

# services.web-development.feature3
source: Cross-browser Compatibility
ar: توافق مع جميع المتصفحات

# services.mobile-development.title
source: Mobile Development
ar: تطوير تطبيقات الهاتف

# services.mobile-development.description
source: Native and cross-platform mobile applications for iOS and Android using Flutter and React Native.
ar: تطبيقات هاتف أصلية ومتعددة المنصات لـ iOS و Android باستخدام Flutter و React Native.

# services.mobile-development.feature0
source: Native Performance
ar: أداء أصلي

# services.mobile-development.feature1
source: Cross-platform Support
ar: دعم متعدد المنصات

# services.mobile-development.feature2
source: App Store Deployment
ar: نشر في متجر التطبيقات

# services.mobile-development.feature3
source: Push Notifications
ar: إشعارات فورية

# services.ui-ux-design.title
source: UI/UX Design
ar: تصميم واجهة المستخدم

# services.ui-ux-design.description
source: Beautiful and intuitive user interfaces designed with user experience as the top priority.
ar: واجهات مستخدم جميلة وبديهية مصممة مع وضع تجربة المستخدم كأولوية قصوى.

# services.ui-ux-design.feature0
source: User Research
ar: بحث المستخدم

# services.ui-ux-design.feature1
source: Wireframing & Prototyping
ar: إطار سلكي ونماذج أولية

# services.ui-ux-design.feature2
source: Visual Design
ar: تصميم بصري

# services.ui-ux-design.feature3
source: Usability Testing
ar: اختبار سهولة الاستخدام

# services.consulting.title
source: Technical Consulting
ar: الاستشارات التقنية

# services.consulting.description
source: Expert advice on technology strategy, architecture decisions, and digital transformation.
ar: نصائح خبراء حول الاستراتيجية التكنولوجية وقرارات البنية والتحول الرقمي.

# services.consulting.feature0
source: Technology Strategy
ar: استراتيجية التكنولوجيا

# services.consulting.feature1
source: Architecture Review
ar: مراجعة البنية

# services.consulting.feature2
source: Performance Audit
ar: تدقيق الأداء

# services.consulting.feature3
source: Best Practices Training
ar: تدريب أفضل الممارسات

# services.starting.from
source: Starting from
ar: ابتداءً من

# services.consultation.title
source: Free Consultation
ar: استشارة مجانية

# services.consultation.description
source: Not sure which service is right for you? Schedule a free consultation with our experts to discuss your needs and find the perfect solution.
ar: لست متأكد من الخدمة المناسبة لك؟ احجز استشارة مجانية مع خبرائنا لمناقشة احتياجاتك والعثور على الحل المثالي.

# services.consultation.contact
source: Contact Us Now
ar: اتصل بنا الآن

# services.consultation.learn
source: Learn More About Us
ar: تعرف علينا أكثر

# contact.title
source: Contact Us
ar: اتصل بنا

# contact.intro
source: We'd love to hear from you! Whether you have questions about our services, need support, or want to discuss a potential project, don't hesitate to get in touch.
ar: نود أن نسمع منكم! سواء كان لديكم أسئلة حول خدماتنا، تحتاجون للدعم، أو تريدون مناقشة مشروع محتمل، لا تترددوا في التواصل معنا.

# contact.info.title
source: Get In Touch
ar: تواصل معنا

# contact.info.phone
source: Phone
ar: الهاتف

# contact.info.email
source: Email
ar: البريد الإلكتروني

# contact.info.address
source: Address
ar: العنوان

# contact.info.address.value
source: 123 Technology Street, Amman, Jordan
ar: شارع التكنولوجيا ١٢٣، عمان، الأردن

# contact.info.hours
source: Business Hours
ar: ساعات العمل

# contact.info.hours.value
source: Sunday - Thursday: 9:00 AM - 6:00 PM
ar: الأحد - الخميس: ٩:٠٠ صباحاً - ٦:٠٠ مساءً

# contact.info.hours.weekend
source: Friday - Saturday: Closed
ar: الجمعة - السبت: مغلق

# contact.form.title
source: Send us a Message
ar: أرسل لنا رسالة

# contact.form.name
source: Your Name
ar: اسمك

# contact.form.name.placeholder
source: Enter your full name
ar: أدخل اسمك الكامل

# contact.form.email
source: Email Address
ar: عنوان البريد الإلكتروني

# contact.form.email.placeholder
source: Enter your email address
ar: أدخل عنوان بريدك الإلكتروني

# contact.form.subject
source: Subject
ar: الموضوع

# contact.form.subject.placeholder
source: What is this about?
ar: ما هو الموضوع؟

# contact.form.message
source: Message
ar: الرسالة

# contact.form.message.placeholder
source: Tell us more about your inquiry...
ar: أخبرنا المزيد عن استفسارك...

# contact.form.submit
source: Send Message
ar: إرسال الرسالة

# contact.back.about
source: ← Back to About
ar: ← العودة إلى من نحن

# contact.back.home
source: ← Back to Home
ar: ← العودة إلى الرئيسية
